rt/bindings/soap2/src/test/resources/org/objectweb/celtix/bindings/soap2/attachments/primarySoapPart.xml

<soap:Envelope xmlns:soap='http://www.w3.org/2003/05/soap-envelope'
	xmlns="http://celtix.objectweb.org/bindings/soap2/attachments/types"
	xmlns:xmlmime='http://www.w3.org/2004/11/xmlmime'>
	<soap:Body>
		<Detail xmlns:m='http://example.org/stuff'>
			<sName>hello world</sName>
			<photo xmlmime:contentType='image/png'>
				<xop:Include xmlns:xop='http://www.w3.org/2004/08/xop/include'
					href='cid:http://celtix.objectweb.org/me.jpg'/>
			</photo>
			<sound xmlmime:contentType='audio/x-wav'>
				<xop:Include xmlns:xop='http://www.w3.org/2004/08/xop/include'
					href='cid:http://celtix.objectweb.org/my.wav'/>
			</sound>
		</Detail>
	</soap:Body>
</soap:Envelope>